tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"

cask "1password"
cask "adguard"
cask "dropbox"
cask "flux"
cask "gitter"
cask "google-chrome"
cask "google-drive-file-stream"
cask "font-inconsolata-nerd-font"
cask "font-meslo-nerd-font"
cask "font-sourcecodepro-nerd-font"
cask "iterm2"
cask "key-codes"
cask "mactex"
cask "omnigraffle"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "skim"
cask "skype"
cask "slack"
cask "suspicious-package"
cask "whatsapp"
cask "xquartz"
cask "zoomus"

brew "bro"
brew "bash-snippets"
brew "clang-format"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "doxygen"
brew "ffmpeg"
brew "figlet"
brew "flatbuffers", args: ["HEAD"]
brew "gcc"
brew "gcovr"
brew "gnupg"
brew "google-benchmark"
brew "gperftools"
brew "gpg-agent"
brew "graphviz"
brew "r"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "keychain"
brew "lbdb"
brew "macvim"
brew "mas"
brew "mdv"
brew "mutt"
brew "ninja"
brew "nmap"
brew "node"
brew "offlineimap"
brew "opensc"
brew "openssh"
brew "p7zip"
brew "par"
brew "procmail"
brew "pstree"
brew "pwgen"
brew "python"
brew "python3"
brew "qcachegrind"
brew "reattach-to-user-namespace"
brew "rocksdb"
brew "ruby"
brew "snappy"
brew "speedtest_cli"
brew "terminal-notifier"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tree"
brew "urlview"
brew "vim", args: ["with-client-server", "with-override-system-vi"]
brew "watch"
brew "w3m"
brew "wget"
brew "youtube-dl"
brew "zplug", args: ["HEAD"]
brew "zsh"

mas "2Do", id: 477670270
