tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/core"
#tap "homebrew/dupes"
tap "homebrew/services"
tap "koekeishiya/formulae"

cask "1password"
cask "docker"
cask "transmit"
cask "visual-studio-code"
cask "dropbox"
cask "meld"

cask "font-inconsolata-nerd-font"
cask "font-meslo-nerd-font"
cask "font-sourcecodepro-nerd-font"
cask "iterm2"
cask "skype"
cask "slack"
cask "suspicious-package"
cask "whatsapp"
cask "zoomus"
cask "robo-3t"
cask "fork"
cask "react-native-debugger"
brew "bro"
brew "bash-snippets"
brew "clang-format"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "doxygen"
brew "ffmpeg"
brew "figlet"
brew "flatbuffers", args: ["HEAD"]
brew "gcc"
brew "gcovr"
brew "gnupg"
brew "google-benchmark"
brew "gperftools"
brew "gpg-agent"
brew "graphviz"
brew "r"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "keychain"
brew "lbdb"
brew "macvim"
brew "mas"
brew "mdv"
brew "mutt"
brew "neofetch"
brew "ninja"
brew "nmap"
brew "node"
brew "offlineimap"
brew "opensc"
brew "openssh"
brew "p7zip"
brew "par"
brew "procmail"
brew "pstree"
brew "pwgen"
brew "python"
brew "python3"
brew "qcachegrind"
brew "rocksdb"
brew "ruby"
brew "snappy"
brew "speedtest_cli"
brew "stdman"
brew "terminal-notifier"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tree"
brew "urlview"
brew "vim"
brew "w3m"
brew "watch"
brew "wdiff"
brew "wget"
brew "youtube-dl"
brew "zplug", args: ["HEAD"]
brew "zsh"
brew "chunkwm"
brew "skhd"
