tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "buo/cask-upgrade"

# Needed up here so that installation of google font casks does not fail.
brew "svn"

cask "1password"
cask "adguard"
cask "docker"
cask "dropbox"
cask "flux"
cask "google-chrome"
cask "google-drive"
cask "font-fira-code-nerd-font"
cask "font-source-sans-pro"
cask "font-volkhov"
cask "istat-menus"
cask "karabiner-elements"
cask "key-codes"
cask "kitty"
cask "mactex"
cask "microsoft-office"
cask "noun-project"
cask "obsidian"
cask "rectangle-pro"
cask "skim"
cask "slack"
cask "suspicious-package"
cask "whatsapp"
cask "xquartz"
cask "zoom"

brew "bat"
brew "ccache"
brew "clang-format"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "dog"
brew "doxygen"
brew "dust"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fisher"
brew "fzf"
brew "gcc"
brew "gcovr"
brew "gh"
brew "git-delta"
brew "glances"
brew "glow"
brew "gnupg"
brew "google-benchmark"
brew "graphviz"
brew "r"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "lbdb"
brew "llvm"
brew "mas"
brew "mdv"
brew "neofetch"
brew "neomutt"
brew "neovim"
brew "ninja"
brew "nmap"
brew "node"
brew "offlineimap"
brew "openssh"
brew "openssl"
brew "p7zip"
brew "par"
brew "pinentry-mac"
brew "procmail"
brew "pstree"
brew "pwgen"
brew "python"
brew "python3"
brew "ruby"
brew "shellcheck"
brew "speedtest_cli"
brew "starship"
brew "stdman"
brew "terminal-notifier"
brew "tcpdump"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tree"
brew "urlview"
brew "vale"
brew "w3m"
brew "watch"
brew "wdiff"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zeek"

# VAST
brew "apache-arrow"
brew "flatbuffers"
brew "fmt"
brew "pandoc"
brew "simdjson"
brew "spdlog"
brew "yaml-cpp"

#mas "keynote", id: 409183694
#mas "pages", id: 409201541
#mas "numbers", id: 409203825
mas "wireguard", id: 1451685025
mas "SideNotes", id: 1441958036
