tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "buo/cask-upgrade"

# Needed up here so that installation of google font casks does not fail.
brew "svn"

cask "1password"
cask "adguard"
cask "docker"
cask "dropbox"
cask "flux"
cask "google-chrome"
cask "google-drive"
cask "font-meslo-lg"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono"
cask "font-source-sans-pro"
cask "font-volkhov"
cask "iterm2"
cask "istat-menus"
cask "karabiner-elements"
cask "key-codes"
cask "mactex"
cask "microsoft-office"
cask "noun-project"
cask "omnigraffle"
cask "skim"
cask "slack"
cask "suspicious-package"
cask "whatsapp"
cask "xquartz"
cask "zoom"

brew "ccache"
brew "clang-format"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "doxygen"
brew "ffmpeg"
brew "figlet"
brew "flatbuffers"
brew "gcc"
brew "gcovr"
brew "glow"
brew "gnupg"
brew "google-benchmark"
brew "graphviz"
brew "r"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "lbdb"
brew "llvm"
brew "macvim"
brew "mas"
brew "mdv"
brew "mutt"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "nmap"
brew "node"
brew "offlineimap"
brew "openssh"
brew "openssl"
brew "p7zip"
brew "par"
brew "procmail"
brew "pstree"
brew "pwgen"
brew "python"
brew "python3"
brew "ruby"
brew "speedtest_cli"
brew "stdman"
brew "terminal-notifier"
brew "tcpdump"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tree"
brew "urlview"
brew "w3m"
brew "watch"
brew "wdiff"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zeek"
brew "zsh"

mas "keynote", id: 409183694
mas "pages", id: 409201541
mas "numbers", id: 409203825
mas "wireguard", id: 1451685025
